sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
/*
 * Tarea_3.c
 *
 *  Created on: Jul 3, 2026
 *      Author: Sophia Alejandra Velasquez Fuentes - sovelasquezf@unal.edu.co
 *      Brief: Led RGB controlado por señales PWM dirigidas por elementos diferentes (USART, Encoder y ADC (Potenciometro))
 *
 *  Distribución de los Timers - Pines
 *
 *  - TIM1 - AF01 (PWM)
 *  	CH2 -> PA9: Color verde
 *  	CH3 -> PA10: Color Rojo
 *  	CH4 -> PA11: Color Azul
 *
 *  - TIM2
 *    (Encoder - Verde) - AF01
 *  	CH1 -> PA0: CLK
 *  	CH2 -> PA1: DT
 *
 *    (Comunicación Serial - Rojo) - AF07
 *  	CH3 -> PA2: USART2_TX (Transmisión)
 *  	CH4 -> PA3: USART2_RX (Recepción)
 *
 *  - TIM3 - AF02 (Potenciómetro - Azul)
 *  	CH1 -> PA6: ADC1_6 (Conversión analogo-digital)
 *
 *  - TIM4 (Led OK)
 * 		PH1: Pin asociado a D2 en la board táctica
 *
 * 	- Extra - AF00:
 * 		PA8: MCO_1
 *
 *
 *	Descripción del código
 *
 *	El sistema controla la intensidad de un LED RGB mediante 3 señales PWM
 *	independientes que se manejan por 3 periféricos diferentes. Las señales
 *	PWM son generadas por el temporizador TIM1 a una frecuencia fija de
 *	2.5 kHz y con una resolución o escala de 0 a 400 unidades de conteo.
 *
 *	- Canal Rojo (USART en PA2 y PA3): El periférico USART2 recibe comandos
 *	asíncronos desde la PC a 19200 bps. Los caracteres +, -, 0 y M modifican
 *	el brillo en pasos exactos del 1% (4 unidades de PWM).
 *
 *	- Canal Verde (Encoder en PA0 y PA1): Procesa el desplazamiento angular
 *	del encoder de forma que se cuenta de forma automática cada transición
 *	eléctrica entre los pines, además de sumar o restar cuentas según la
 *	dirección en que se gira.
 *
 *	- Canal Azul (ADC en PA6): El temporizador TIM3 dispara automáticamente
 *	por TGRO activando el ADC de 12 bits cada 20 ms. Además se filtra por
 *	software de forma que las variaciones menores a 1% no afecten al sistema.
 *
 *	Cada vez que un periférico cambia de forma válida, se pasa a transmitir
 *	un mensaje por puerto serial donde se muestran los valores en los que se
 *	encuentar el sistema. En paralelo, el TIM4 genera por interrupción un
 *	parpadeo permanente de seguridad en el pin PH1 cada 250 ms.
 *
 */

#include <stm32f4xx_hal.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

TIM_HandleTypeDef htim1;			//TIM1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim2;			//TIM2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim3;			//TIM3 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

TIM_HandleTypeDef htim4;			//TIM4 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

ADC_HandleTypeDef hadc1 = {0};		//ADC1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

UART_HandleTypeDef huart2 = {0};	//USART2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el


/*Variables*/
/*Mensaje inicial con las indicaciones para la recepción*/
uint8_t init_Msg[] =
"\r\n"
"Tarea 3 - Sophia Velasquez\r\n"
"--------------------------------------------------\r\n"
"Caracteres para la recepción:\r\n"
" '+': Incrementa el brillo en 1%\r\n"
" '-': Decrementa el brillo en 1%\r\n"
" '0': Lleva el valor a 0%\r\n"
" 'M': Lleva el valor al punto intermedio (50%)\r\n"
"--------------------------------------------------\r\n"
"\r\n";

/*Variables donde se almacena el dutty cycle para cada canal (Verde: CH2, Rojo: CH3 y Azul: CH4*/
volatile uint16_t pwm_rojo = 0;
volatile uint16_t pwm_verde = 0;
volatile uint16_t pwm_azul = 0;

/*Variables usadas para hacer la comparación a la hora de actualizar los valores*/
volatile uint16_t actual_rojo = 0;
volatile uint16_t actual_verde = 0;
volatile uint16_t actual_azul = 0;

volatile uint16_t raw_adc = 0;		//Almacena el valor para la conversión ADC
volatile uint16_t adc_done = 0;		//Bandera para la conversión ADC
float adc_value_mv = 0.0f;			//Almacena el valor convertido por ADC en mV

volatile uint16_t raw_usart = 0;	//Almacena el valor para la comunicación serial
volatile uint8_t usart_done = 0;	//Bandera para la comunicación serial
volatile uint8_t rx_data = 0;		//Almacena el caracter recibido en la recepción

volatile uint16_t raw_encoder = 0;	//Almacena el valor para el modo Encoder
volatile uint16_t encoder_dir = 0;	//Se guarda el valor de la dirección del Encoder (CW = 0 y CCW = 1)
char* dir_str = 0;					//String que indica la dirección usado en la transmisión

uint8_t msg_buffer[256];			//Mensaje completo donde se muestran los valores actuales del equipo a medida que se van actualizando


/*Implementación FSM*/
typedef enum{
	STATE_CHECK = 0,		//Verifica el cambio en algún periférico comparando con los valores actuales
	STATE_UPDATE_ADC,		//Estado de lectura analógica y actualización del azul
	STATE_UPDATE_ENCODER,	//Estado de lectura del Encoder y actualización del verde
	STATE_UPDATE_USART,		//Esatado de recepcion de caracteres y actualización del rojo
	STATE_TRANSMIT_MSG		//Transmisión de datos actualizados
} FSM_STATE;

FSM_STATE estado_actual = STATE_CHECK;


/*Prototipo de funciones privadas*/
static void SystemClock_Config(void);
static void gpio_Init(void);
static void tim1_pwm_Init(void);
static void tim2_encoder_Init(void);
static void tim3_adc_Init(void);
static void tim4_led_ok_Init(void);
static void usart2_Init(void);
static void adc_Init(void);
static void mco1_Init(void);


int main(void){

	/*Inicialización de los bloques independientes*/
	HAL_Init();				//Inicializa HAL: SysTick, caché, agrupación de prioridades
	SystemClock_Config();	//Configura el árbol de relojes: HSI a 16 MHz
	gpio_Init();			//Configura PH1 (Led en la tarjeta nucleo)
	tim4_led_ok_Init();		//Configura TIM4: evento de actualización cada 250 ms

	tim1_pwm_Init();		//Configura PWM a 2.5 kHz para el led RGB (PA9, PA10, PA11) con resolución de 400
	tim2_encoder_Init();	//Configura TIM2 en modo Encoder (PA0, PA1)
	tim3_adc_Init();		//Configura TIM3 para el disparo del ADC (PA6) usando el TGRO (Trigger automático a 20ms)
	usart2_Init();			//Configura USART2 a 19200 bps (8N1) en modo asíncrono (UART) para transmisión y recepción
	adc_Init();				//Configura PA6 para ADC de 12 bits sincronizado con TIM3
	mco1_Init();			//Habilita el pin PA8 para monitorear el reloj HSI en osciloscopio

	/*Transmisión del mensaje inicial (Instrucción con los caracteres específicos a usar)*/
	HAL_UART_Transmit(&huart2, (uint8_t *) init_Msg, strlen((char *) init_Msg), 200);

