sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
	/*Inicializa todos los canales en 0%*/
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);

	while(1){

		switch(estado_actual){

		case STATE_CHECK:

			if(usart_done == 1){						//Verifica si llegó un nuevo carácter por recepción

				estado_actual = STATE_UPDATE_USART;

			}

			else if((__HAL_TIM_GET_COUNTER(&htim2) / 4) != actual_verde){		//Verifica si el registro del encoder varió respecto al valor almacenado

				estado_actual = STATE_UPDATE_ENCODER;

			}

			else if(adc_done == 1){									//Verifica si el ADC terminó una conversión controlada por el TGRO

				uint16_t temp_azul = (raw_adc * 400) / 4095;		//Lectura temporal del PWM azul

				if(abs((int)temp_azul - (int)actual_azul) > 4){		//Se verifica que si haya una diferencia mayor al 1% (4 unidades)

					estado_actual = STATE_UPDATE_ADC;

				}

				else{

					adc_done = 0;	//Si la diferencia no se cumple se toma como ruido y se limpia la bandera

				}

			}

			break;

		case STATE_UPDATE_ADC:

			pwm_azul = (raw_adc * 400) / 4095;							//Se hace la conversión a la escala de 0 a 400

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, pwm_azul);		//Se carga el valor del CCR al PWM del canal 4

			actual_azul = pwm_azul;										//Se sobreescribe el valor para la próxima comparación

			adc_done = 0;												//Se baja la bandera

			estado_actual = STATE_TRANSMIT_MSG;

			break;

		case STATE_UPDATE_ENCODER:

			raw_encoder = __HAL_TIM_GET_COUNTER(&htim2) / 4;			//Se lee el valor contado (Se divide por la cantidad de flancos contados)

			actual_verde = raw_encoder;									//Se sobreescribe el valor para la próxima comparación

			pwm_verde = raw_encoder * 4;								//Se hace la conversión para que el valor vaya de 0 a 400

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, pwm_verde);	//Se carga el valor del CCR al PWM del canal 2

			estado_actual = STATE_TRANSMIT_MSG;

			break;

		case STATE_UPDATE_USART:

			raw_usart = pwm_rojo / 4;		//Convierte temporalmente el ciclo actual de PWM a escala de clics (0-100)

			/*Identificación de caracteres a recibir*/
			if(rx_data == '+'){				//Aumento de 1%
				if(raw_usart < 100){

					raw_usart++;

				}

			}

			else if(rx_data == '-'){		//Decremento de 1%
				if(raw_usart > 0){

					raw_usart--;

				}

			}

			else if(rx_data == '0'){		//Reinicia en 0%

				raw_usart = 0;

			}

			else if(rx_data == 'M'){		//Lleva a punto medio (50%)

				raw_usart = 50;

			}

			pwm_rojo = raw_usart * 4;		//Reescala nuevamente de 0 a 400

			actual_rojo = pwm_rojo;

			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, pwm_rojo);		//Se carga el valor del CCR al PWM del canal 2

			HAL_UART_Receive_IT(&huart2, (uint8_t *) &rx_data, 1);		//Reactiva la interrupción de recepción UART para el siguiente byte

			usart_done = 0;												//Se baja la bandera

			estado_actual = STATE_TRANSMIT_MSG;

			break;

		case STATE_TRANSMIT_MSG:

			adc_value_mv = (float)((3300.0f / 4095.0f) * raw_adc);		//Conversión del valor raw adc en un valor de mV

			encoder_dir = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2);		//Evaluación de la dirección de conteo para después escribir el string indicado

			if(encoder_dir == 1){

				dir_str = "CCW";

			}

			else if(encoder_dir == 0){

				dir_str = "CW";

			}


			uint16_t clicks_rojo = pwm_rojo / 4;							//Variable local donde se guardan la cantidad de clicks en el PWM Rojo (USART2)

			uint16_t pasos_encoder = __HAL_TIM_GET_COUNTER(&htim2) / 4;		//Variable local donde se guardan los pasos dados en el Encoder

			/*Mensaje a enviar después de reconocer cambios y actualizarse los datos*/
			sprintf((char *) msg_buffer,
			"--------------------------------------------------\r\n"
			"ADC value = %u raw\r\n"
			"ADC value = %.0f mV\r\n"
			"Encoder dir: %s, value = %u\r\n"
			"UART value = %u clicks\r\n"
			"--------------------------------------------------\r\n"
			"\r\n",raw_adc, adc_value_mv, dir_str, pasos_encoder, clicks_rojo);

			HAL_UART_Transmit(&huart2, msg_buffer, strlen((char *) msg_buffer), 200);		//Transmisión del mensaje

			estado_actual = STATE_CHECK;

			break;

		default:

			estado_actual = STATE_CHECK;

			break;

		}

	}

}


/*Funciones privadas*/

/*
 * SystemClock_Config
 * Usa el oscilador interno HSI a 16 MHz
 * Sin PLL — configuración de reloj más simple posible
 */
static void SystemClock_Config(void){

	/*Inicialización de estructuras*/
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /*HSI ya está encendido al resetear (Confirmar y usarlo)*/
    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;			//Oscilador Interno de Alta Velocidad (HSI)
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;						//Encendido del HSI
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;		//Calibración por defecto de fábrica para el HSI
    RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_NONE;					//Desactivación del PLL para trabajar a 16 MHz

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /*Seleccionar HSI como SYSCLK (Todos los divisores de bus en 1)*/
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK |	//Configuración simultánea de los relojes
                                       RCC_CLOCKTYPE_HCLK   |
                                       RCC_CLOCKTYPE_PCLK1  |
                                       RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_HSI;	//Reloj del sistema (SYSCLK) = 16 MHz
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;   		//Divisor del AHB (HCLK) en 1 = 16 MHz
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;     		//Divisor del APB1 (PCLK1) en 1 = 16 MHz
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     		//Divisor del APB2 (PCLK2) en 1 = 16 MHz

    /*FLASH_LATENCY_0 = cero wait states, correcto para 16 MHz*/
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);

