sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
}


/*
 * gpio_Init
 * Configura PH1 como salida Push-Pull (Led D2 de la tarjeta nucleo)
 */
static void gpio_Init(void){

	/*Inicialización de estructuras*/
    GPIO_InitTypeDef GPIO_InitStruct = {0};

	/*Habilitar reloj de GPIOH en el bus AHB1*/
	__HAL_RCC_GPIOH_CLK_ENABLE();

    /*Configuración PH1*/
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;		//Establece el pin en modo salida Push-Pull
    GPIO_InitStruct.Pull  = GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;		//Configuración de velocidad como baja

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

}


/*
 * tim1_pwm_Init
 * Configura el TIM1 en modo PWM para controlar los canales 2, 3 y 4
 * Frecuencia 2.5 kHz
 */
static void tim1_pwm_Init(void){

	/*Configuración de pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_pwm = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA9, PA10, PA11*/
	GPIO_Init_pwm.Pin		= GPIO_PIN_9  |
							  GPIO_PIN_10 |
							  GPIO_PIN_11;
	GPIO_Init_pwm.Mode		= GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_pwm.Pull		= GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_Init_pwm.Speed		= GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_pwm.Alternate = GPIO_AF1_TIM1;			//Función alernativa correspondiente a AF1 en TIM1

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_GPIO_Init(GPIOA, &GPIO_Init_pwm);

	/*Configuración del TIM1*/
	/*Habilitar reloj de TIM1 en el bus APB2*/
	__HAL_RCC_TIM1_CLK_ENABLE();

	/*Configuración general del TIM1*/
	htim1.Instance				 = TIM1;
	htim1.Init.Prescaler		 = 16 - 1;								//Configurando el Prescaler a 1 us (16 MHz / 16 = 1 MHz)
	htim1.Init.CounterMode		 = TIM_COUNTERMODE_UP;					//Conteo ascendente
	htim1.Init.Period 			 = 400 - 1;								//Periodo de 1 us * 400 = 400 us (2.5 kHz)
	htim1.Init.ClockDivision 	 = TIM_CLOCKDIVISION_DIV1;				//División en 1 = 2.5 kHz
	htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;		//Habilita la precarga automática

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_TIM_PWM_Init(&htim1);

	/*Configuración de canales del TIM1: CH2, CH3 y CH4*/
	/*Inicialización de estructuras*/
	TIM_OC_InitTypeDef ConfigOC =  {0};

	/*Configuración general de los canales*/
	ConfigOC.OCMode 	= TIM_OCMODE_PWM1;			//Establece el modo PWM1 (Salida en alto mientras CNT < CCR)
	ConfigOC.Pulse 		= 0;						//Inicializa el CCR en 0%
	ConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;		//Configura polaridad alta (En alto hay un 1 lógico)
	ConfigOC.OCFastMode = TIM_OCFAST_DISABLE;		//Evita fallos en el ciclo de trabajo (Sólo cambiará su estado después de una comparación válida entre el CNT y CCR)

	/*Cargar la configuracion en los registros FSR del MCU (Para cada canal) */
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_2);
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_3);
	HAL_TIM_PWM_ConfigChannel(&htim1, &ConfigOC, TIM_CHANNEL_4);

	/*Inicialiación de cada canal */
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

}


/*
 * tim2_encoder_Init
 * Configura el TIM2 (32 bits) en modo Encoder
 * Utiliza los canales 1 y 2 para las entradas CLK (PA0) y DT (PA1)
 */
static void tim2_encoder_Init(void){

	/*Configuración de pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_encoder = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA0 y PA1*/
	GPIO_Init_encoder.Pin 		= GPIO_PIN_0 |
							  	  GPIO_PIN_1;
	GPIO_Init_encoder.Mode 		= GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_encoder.Pull 		= GPIO_PULLUP;				//Activa resistencia Pull-Up interna para evitar estados flotantes
	GPIO_Init_encoder.Speed 	= GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_encoder.Alternate = GPIO_AF1_TIM2;			//Función alternativa correspondiente a AF1 en TIM2

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_GPIO_Init(GPIOA, &GPIO_Init_encoder);

	/*Configuración de canales del TIM2: CH1 y CH2*/
	/*Inicialización de estructuras*/
	TIM_Encoder_InitTypeDef Config_encoder = {0};

	/*Habilitar reloj de TIM2 en el bus APB1*/
	__HAL_RCC_TIM2_CLK_ENABLE();

	/*Configuración general del TIM2*/
	htim2.Instance				 = TIM2;
	htim2.Init.Prescaler		 = 0;									//No se va a hacer división a los pulsos del encoder
	htim2.Init.CounterMode		 = TIM_COUNTERMODE_UP;					//El conteo depende del sentido (CW o CCW)
	htim2.Init.Period 			 = 65535;								//El conteo máximo es 65535 para guardarse en una variable de 16 bit
	htim2.Init.ClockDivision 	 = TIM_CLOCKDIVISION_DIV1;				//División en 1
	htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;		//Deshabilita la precarga automática

	/*Configuración de los canales*/
	/*Configuración del encoder para usar ambos canales CH1 y CH2*/
	Config_encoder.EncoderMode = TIM_ENCODERMODE_TI12;		//Detecta flancos de subida y bajada en cada canal para calcular el sentido de giro (Cuenta 4 veces por ciclo)

	/*Configuración general para CH1*/
	Config_encoder.IC1Polarity 	= TIM_INPUTCHANNELPOLARITY_RISING;		//Polaridad de entrada con flanco de subida
	Config_encoder.IC1Selection = TIM_ICSELECTION_DIRECTTI;				//El input 1 (PA0) se conecta al IC1
	Config_encoder.IC1Prescaler = TIM_ICPSC_DIV1;						//La captura se hace al detectar un flanco sin división
	Config_encoder.IC1Filter 	= 15;									//Se usa el valor máximo del filtro para evitar rebotes

	/*Configuración general para CH2*/
	Config_encoder.IC2Polarity 	= TIM_INPUTCHANNELPOLARITY_RISING;		//Polaridad de entrada con flanco de subida
	Config_encoder.IC2Selection = TIM_ICSELECTION_DIRECTTI;				//El input 2 (PA1) se conecta al IC2
	Config_encoder.IC2Prescaler = TIM_ICPSC_DIV1;						//La captura se hace al detectar un flanco sin división
	Config_encoder.IC2Filter 	= 15;									//Se usa el valor máximo del filtro para evitar rebotes

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_TIM_Encoder_Init(&htim2, &Config_encoder);

	/*Inicialización de todos los canales*/
	HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);

