sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
}

/*
 * tim3_adc_Init
 * Configuración del TIM3 a 20 ms para disparar el ADC usando la señal TGRO
 */
static void tim3_adc_Init(void){

	/*Configuración del TIM3*/
	/*Habilitar reloj de TIM3 en el bus APB1*/
	__HAL_RCC_TIM3_CLK_ENABLE();

	/*Configuración general del TIM3*/
	htim3.Instance				 = TIM3;
	htim3.Init.Prescaler		 = 16000 - 1;							//Configurando el Prescaler a 1 ms (16 MHz / 16 kHz = 1 kHz)
	htim3.Init.CounterMode 		 = TIM_COUNTERMODE_UP;					//Conteo ascendente
	htim3.Init.Period 			 = 20 - 1;								//Periodo de 1 ms * 20 = 20 ms
	htim3.Init.ClockDivision 	 = TIM_CLOCKDIVISION_DIV1;				//División en 1 = 20 ms
	htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;		//Deshabilita la precarga automática

	/*Cargando la configuración en los registros FSR del MCU*/
	HAL_TIM_Base_Init(&htim3);

	/*Configuración del trigger (TGRO)*/

	/*Inicialización de estructuras*/
	TIM_MasterConfigTypeDef MasterConfig_TGRO = {0};

	/*Configuración general del TGRO*/
	MasterConfig_TGRO.MasterOutputTrigger = TIM_TRGO_UPDATE;				//Genera un evento de actualización cada 20 ms
	MasterConfig_TGRO.MasterSlaveMode 	  = TIM_MASTERSLAVEMODE_DISABLE;

	/*Cargando la configuración en los registros FSR del MCU*/
	HAL_TIMEx_MasterConfigSynchronization(&htim3, &MasterConfig_TGRO);

	/*Inicialización del TIM3*/
	HAL_TIM_Base_Start(&htim3);

}


/*
 * tim4_led_ok_Init
 * Configura TIM4 para generar un evento de actualización cada 250 ms
 */
static void tim4_led_ok_Init(void){

	/*Configuración del TIM4*/
	/*Habilitar reloj de TIM4 en el bus APB1*/
	__HAL_RCC_TIM4_CLK_ENABLE();

	/*Configuración general del TIM3*/
	htim4.Instance				 = TIM4;
	htim4.Init.Prescaler		 = 16000 - 1;							//Configurando el Prescaler a 1 ms (16 MHz / 16 kHz = 1 kHz)
	htim4.Init.CounterMode 		 = TIM_COUNTERMODE_UP;					//Conteo ascendente
	htim4.Init.Period 			 = 250 - 1;								//Periodo de 1 ms * 250 = 250 ms
	htim4.Init.ClockDivision 	 = TIM_CLOCKDIVISION_DIV1;				//División en 1 = 250 ms
	htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;		//Deshabilita la precarga automática

	/*Cargando la configuración en los registros FSR del MCU*/
	HAL_TIM_Base_Init(&htim4);

	/*Registrando la interrupción en el NVIC para la recepción*/
	HAL_NVIC_EnableIRQ(TIM4_IRQn);

	/*Inicialización del TIM4 en modo de interrupción Update Event Interrupt (UEI)*/
	HAL_TIM_Base_Start_IT(&htim4);

}


/*
 * usart2_Init
 * Configuración de pines físicos como función alternada para la comunicación serial
 * 19200 8N1
 */
static void usart2_Init(void){

	/*Configuración de los pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_Tx = {0};
	GPIO_InitTypeDef GPIO_Init_Rx = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA2 y PA3 */
	GPIO_Init_Tx.Pin	   = GPIO_PIN_2;
	GPIO_Init_Tx.Mode 	   = GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_Tx.Pull  	   = GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_Init_Tx.Speed	   = GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_Tx.Alternate = GPIO_AF7_USART2;			//Función alternativa correspondiente a AF7 en USART2

	GPIO_Init_Rx.Pin	   = GPIO_PIN_3;
	GPIO_Init_Rx.Mode 	   = GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_Rx.Pull  	   = GPIO_PULLUP;				//Activa resistencia Pull-Up interna para evitar estados flotantes
	GPIO_Init_Rx.Speed	   = GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_Rx.Alternate = GPIO_AF7_USART2;			//Función alternativa correspondiente a AF7 en USART2

	/*Cargar la configuración en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_Init_Tx);
	HAL_GPIO_Init(GPIOA, &GPIO_Init_Rx);

	/*Configuración del USART2*/
	/*Habilitar reloj de TIM2 en el bus APB1*/
	__HAL_RCC_USART2_CLK_ENABLE();

	/*Configuración general del USART2*/
	huart2.Instance          = USART2;
	huart2.Init.BaudRate     = 19200;
	huart2.Init.Mode         = UART_MODE_TX_RX;			//Establece modo de transmisión (Tx) y recepción (Rx)
	huart2.Init.Parity       = UART_PARITY_NONE;		//Sin paridad
	huart2.Init.StopBits     = UART_STOPBITS_1;			//1 bit de parada
	huart2.Init.WordLength   = UART_WORDLENGTH_8B;		//8 bits de datos

	/*Cargar la configuración en los registros FSR del MCU*/
	HAL_UART_Init(&huart2);

	/*Registrando la interrupción en el NVIC para la recepción*/
	HAL_NVIC_EnableIRQ(USART2_IRQn);

	/*Habilitar la interrupción para la recepción de datos*/
	HAL_UART_Receive_IT(&huart2, (uint8_t *) &rx_data, 1);	//El dato se guarda en la variable rx_data de a byte

}


/*
 * adc_Init
 * Configuración del ADC
 */
static void adc_Init(void){

	/*Configuración de PA6*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_adc_ch6 = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general del pin*/
	GPIO_Init_adc_ch6.Pin  = GPIO_PIN_6;
	GPIO_Init_adc_ch6.Mode = GPIO_MODE_ANALOG;		//Configura el pin en modo analógico
	GPIO_Init_adc_ch6.Pull = GPIO_NOPULL;			//Desactiva resistencias de Pull-Up o Pull-Down

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_Init_adc_ch6);

	/*Configuración del ADC*/
	/*Habilitar reloj de ADC en el bus APB2*/
	__HAL_RCC_ADC1_CLK_ENABLE();

	/*Configuración general del ADC*/
	hadc1.Instance					 = ADC1;
	hadc1.Init.ClockPrescaler		 = ADC_CLOCK_SYNC_PCLK_DIV2;			//División 2: 16 MHz / 2 = 8 MHz
	hadc1.Init.Resolution			 = ADC_RESOLUTION_12B;					//Resolución 12 bit (4096 divisiones)
	hadc1.Init.DataAlign			 = ADC_DATAALIGN_RIGHT;
	hadc1.Init.ScanConvMode			 = DISABLE;								//Deshabilitado por ser el unico canal de conversión ADC
	hadc1.Init.EOCSelection			 = ADC_EOC_SINGLE_CONV;					//Conversión finaliza al terminal el canal
	hadc1.Init.ContinuousConvMode	 = DISABLE;
	hadc1.Init.NbrOfConversion 		 = 1;									//Sólo hay un canal haciendo conversión ADC
	hadc1.Init.DiscontinuousConvMode = DISABLE;
	hadc1.Init.ExternalTrigConv		 = ADC_EXTERNALTRIGCONV_T3_TRGO;		//Se usa el TGRO del TIM3 como trigger para la conversión
	hadc1.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;		//Se dispara el ADC cada vez que se detecta un flanco de subida
	hadc1.Init.DMAContinuousRequests = DISABLE;

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_ADC_Init(&hadc1);

