sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Tarea_3.c
	/*Configuración del canal específico*/

	/*Inicialización de estructuras*/
	ADC_ChannelConfTypeDef adc_ch6 = {0};

	/*Configuración general del canal*/
	adc_ch6.Channel		 = ADC_CHANNEL_6;
	adc_ch6.Rank		 = 1;							//Primera y única conversión a hacer
	adc_ch6.SamplingTime = ADC_SAMPLETIME_56CYCLES;		//Cantidad de ciclos a pasar para hacer el muestreo (carga del capacitor)
	adc_ch6.Offset		 = 0;

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_ADC_ConfigChannel(&hadc1, &adc_ch6);

	/*Registrar la interrupción en el NVIC*/
	HAL_NVIC_EnableIRQ(ADC_IRQn);

	/*Inicialización del ADC1*/
	HAL_ADC_Start_IT(&hadc1);

}


/*
 * mco1_Init
 * Configura el MCO1 como salida para leer el HSI en PA8
 */
static void mco1_Init(void){

	/*Configuración de los pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef mco1_Init = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA8*/
	mco1_Init.Pin	    = GPIO_PIN_8;
	mco1_Init.Mode 	    = GPIO_MODE_AF_PP;				//Establece los pines en modo función alternativa
	mco1_Init.Pull  	= GPIO_NOPULL;					//Desactiva resistencias de Pull-Up o Pull-Down
	mco1_Init.Speed	    = GPIO_SPEED_FREQ_VERY_HIGH;	//Configuración de velocidad como muy alta para evitar distorsiones
	mco1_Init.Alternate = GPIO_AF0_MCO;					//Función alternativa correspondiente a AF0 en MCO1

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &mco1_Init);

	/*Inicialización del MCO1*/
	HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);		//Se redirige la señal del Oscilador Interno de Alta Velocidad (HSI) a PA8

}


/*
 * HAL_TIM_PeriodElapsedCallback
 * Llamado automáticamente por HAL_TIM_IRQHandler() cada vez que un evento de actualización del timer se dispara
 * Es compartido por todos los timers (Siempre verifica htim->Instance)
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){

    if(htim->Instance == TIM4){

        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);

    }
}


/*
 * HAL_ADC_ConvCpltCallback
 * Callback de la conversión ADC
 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){

	if(hadc->Instance == ADC1){

		/*Cargando el dato de la conversión en una variable*/
		raw_adc = hadc->Instance->DR;

		adc_done = 1;

	}

}


/*
 * HAL_UART_RxCpltCallback
 * Callback de la recepción USART
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){

    if (huart->Instance == USART2){

        usart_done = 1;

    }

}

